# Pandas

pandas is a python library built on NumPy.

provides data structure for data manipulation ,preprocessing and analyzing.

### Data stucture

1. Series

2. Dataframe

#### Series

It's a one dimensional data , similar to python list.

It includes name ,Index and data

In [2]:
# import pandas package

import pandas as pd

import numpy as np

##### Basic CRUD operations

###### Create

In [3]:
# create a Series with name 'model' and data [1990, 1991, 2003, 2016]

sample_series = pd.Series([1990 ,1991 ,2003 ,2016 ] , name = 'model')

sample_series

0    1990
1    1991
2    2003
3    2016
Name: model, dtype: int64

In [5]:
# create series from ndarray

sample_narr = np.array([3 ,4 ,5 ,7 ,8])

seri0 = pd.Series(sample_narr)

seri0

0    3
1    4
2    5
3    7
4    8
dtype: int64

In [8]:
# create series from python list

sample_list = [1 ,2 ,3 ,44 ,55 ,66 ]

seri1 = pd.Series(sample_list) 

seri1

0     1
1     2
2     3
3    44
4    55
5    66
dtype: int64

In [12]:
# create series from dictionary

sample_dict = { 'A' : 'apple' , 'B' : 'banana' ,'C': 'candy' , 'D': 'Donkey' }

seri2 = pd.Series(sample_dict , name = 'Word')

seri2

A     apple
B    banana
C     candy
D    Donkey
Name: Word, dtype: object

In [14]:
# create a sample series with name and index

seri3 = pd.Series(['Banana' , 'Apple', 'Mango', 'Orange'] , 
                  index = [ 'First' , 'Sec', 'Third', 'Fourth'] , name = 'Fruits')

seri3

First     Banana
Sec        Apple
Third      Mango
Fourth    Orange
Name: Fruits, dtype: object

###### Retrieve

In [6]:
# indexing starts from 0 , we can access the value using its position number

seri4 = pd.Series([1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9])

seri4[0]                                            # prints the first element 1

1

In [8]:
# retrive Brinjal using index 

seri5 = pd.Series(['Beetroot' , 'carrot', 'Tomato', 'Brinjal'] , 
                  index = [ 'First' , 'Sec', 'Third', 'Fourth'] , name = 'Vegetables')

seri5['Fourth']                                    # use index entry to select the corresponding value

'Brinjal'

In [9]:
seri5.index                                        # prints index entries

Index(['First', 'Sec', 'Third', 'Fourth'], dtype='object')

In [10]:
seri5.values                                       # prints values

array(['Beetroot', 'carrot', 'Tomato', 'Brinjal'], dtype=object)

###### Update

In [11]:
# update entry with index 'First' to strawberry

seri5['First'] = 'Pumpkin'                       # Replace Beetroot and updates to Pumpkin

seri5

First     Pumpkin
Sec        carrot
Third      Tomato
Fourth    Brinjal
Name: Vegetables, dtype: object

In [12]:
# Add a new index and value to existing series

seri5['Fifth'] = 'Bitter Gourd'                         # adds an entry with index = fifth and value = muskmelon

seri5

First          Pumpkin
Sec             carrot
Third           Tomato
Fourth         Brinjal
Fifth     Bitter Gourd
Name: Vegetables, dtype: object

In [13]:
# accessing and updating can be also done using loc and iloc

seri6 = pd.Series(['Ant' ,'Mark' ,'Bosh' ,'cary'])

print(' ')

print(seri6)

print(' ')

seri6.loc[0:3]                                          # prints value from index 0 to 3 

seri6.iloc[0:4]                                         # this method is used when index value is explicitly given
                                                        # somthing else other than 0 to n

0     Ant
1    Mark
2    Bosh
3    cary
dtype: object

0     Ant
1    Mark
2    Bosh
3    cary
dtype: object

###### Delete

In [33]:
# drop 

seri4.drop(0)                                          # drops the first entry

1    Mark
2    Bosh
3    cary
dtype: object

### Dataframe

Its a two dimensional data in tabular form with rows and columns. For example excel spreadsheet

###### Create

In [15]:
# create a dataframe using list

sample_list = ([11 ,22 ,33 ,44 ,55 ,66 ,77 ,88 ,99])

sample_df = pd.DataFrame(sample_list)

sample_df

    0
0  11
1  22
2  33
3  44
4  55
5  66
6  77
7  88
8  99

In [22]:
# dataframe from dictionary

sample_dict = {'Product':['Bru' , 'Nestle' , 'Brooke' , 'Tata'] , 'ID': [1 , 2, 3, 4]}

sample_df1 = pd.DataFrame(sample_dict)

sample_df1

  Product  ID
0     Bru   1
1  Nestle   2
2  Brooke   3
3    Tata   4

In [28]:
# create a dataframe from series

# dictionary of series can be used to create dataframe

dict1 = {'Name' : pd.Series(['Tom', 'Derek', 'Bruno' ,'Mary'], index=['a', 'b', 'c' ,'d']),
   'Age' : pd.Series([12, 21, 53, 24], index=['a', 'b', 'c', 'd'])}

sample_df2 = pd.DataFrame(dict1)

sample_df2

    Name  Age
a    Tom   12
b  Derek   21
c  Bruno   53
d   Mary   24

###### Retriev

In [29]:
# select a column from dataframe

sample_df2['Name']

a      Tom
b    Derek
c    Bruno
d     Mary
Name: Name, dtype: object

In [31]:
# select a row from dataframe

sample_df2.loc['b']                                   # loc retrieves the corresponding row

Name    Derek
Age        21
Name: b, dtype: object

In [33]:
# select row using integer location

sample_df2.iloc[2]                                    # iloc (integer location) used to extract row 
                                                      # when particular index is unknown

Name    Bruno
Age        53
Name: c, dtype: object

In [34]:
# slicing

# select row 1 and 2

sample_df2[1:3]

    Name  Age
b  Derek   21
c  Bruno   53

###### Update

In [46]:
# append a row to existing dataframe or add two dataframes

df = pd.DataFrame([[11, 22], [33, 44]], columns = ['a','b'])
df1 = pd.DataFrame([[55, 66], [77, 88]], columns = ['a','b'])

df = df.append(df1)

df

    a   b
0  11  22
1  33  44
0  55  66
1  77  88

###### Delete

In [49]:
# delete or drop row with index 0 

df2 = df.drop(0)

df2

    a   b
1  33  44
1  77  88

Basic Functions

In [59]:
# ndim returns the number of dimensions

data = {'Album':pd.Series(['Indipop' , 'Hip hop' ,'Classical' ,'Rock']), 'Ratings':pd.Series([7 ,6 ,9 ,10])}

print(' ')

df = pd.DataFrame(data)
 
print(df)

print ("\n The dimensions of the object is: \n")

print(df.ndim)

       Album  Ratings
0    Indipop        7
1    Hip hop        6
2  Classical        9
3       Rock       10

 The dimensions of the object is:

2

In [61]:
# size returns the number of elements in the dataframe

df.size

8

In [62]:
# values returns the data

df.values

array([['Indipop', 7],
       ['Hip hop', 6],
       ['Classical', 9],
       ['Rock', 10]], dtype=object)

In [63]:
# gives first two rows of dataframe

df.head(2)

     Album  Ratings
0  Indipop        7
1  Hip hop        6

In [65]:
# gives last two rows of dataframe

df.tail(2)

       Album  Ratings
2  Classical        9
3       Rock       10

In [70]:
# Descriptive Statistics

data = {'Oil':pd.Series(['Almond' ,'Mustard' ,'Olive' ,'Groundnut' ,'Castor' ,'Coconut' ,'Sunflower']),
     'Price' :pd.Series([165 ,120 ,700 ,300 ,575 , 487, 310]),
     'Consumption Rate':pd.Series([69 , 75, 55, 78, 87, 92, 98])}

df = pd.DataFrame(data)

df

         Oil  Price  Consumption Rate
0     Almond    165                69
1    Mustard    120                75
2      Olive    700                55
3  Groundnut    300                78
4     Castor    575                87
5    Coconut    487                92
6  Sunflower    310                98

In [71]:
# mean                                               

df.mean()                                          # returns mean of numerical values

Price               379.571429
Consumption Rate     79.142857
dtype: float64

In [72]:
# median

df.median()                                        # returns median of numerical vales

Price               310.0
Consumption Rate     78.0
dtype: float64

In [74]:
# sum

df['Price'].sum()                                  # returns sum of column 'price'

2657

In [75]:
# count

df['Oil'].count()                                  # returns total non null values in the column

7

In [76]:
# standard deviation

df.std()                                           # returns Standard Deviation of the Values

Price               214.863412
Consumption Rate     14.645006
dtype: float64

In [77]:
# min

df['Consumption Rate'].min()                        # returns Minimum Value of the column

55

In [78]:
# max

df['Consumption Rate'].max()                        # returns Minimum Value of the column

98

In [79]:
# summarizing descriptive statistics

df.describe()                                       # computes summary statistics of all numeric data

            Price  Consumption Rate
count    7.000000          7.000000
mean   379.571429         79.142857
std    214.863412         14.645006
min    120.000000         55.000000
25%    232.500000         72.000000
50%    310.000000         78.000000
75%    531.000000         89.500000
max    700.000000         98.000000

###### Function

In [ ]:
# funtion 

# row/column wise

# Element wise